backend/.run/loadtest/report_100/statistics.json
{
  "feed_popularity" : {
    "transaction" : "feed_popularity",
    "sampleCount" : 62488,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 38.13143323518125,
    "medianResTime" : 36.0,
    "minResTime" : 2.0,
    "maxResTime" : 232.0,
    "pct1ResTime" : 44.0,
    "pct2ResTime" : 48.0,
    "pct3ResTime" : 64.0,
    "throughput" : 1043.6060590877967,
    "receivedKBytesPerSec" : 1331.0053839537718,
    "sentKBytesPerSec" : 449.44362505636553
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 249971,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 21.979773653743784,
    "medianResTime" : 18.0,
    "minResTime" : 0.0,
    "maxResTime" : 372.0,
    "pct1ResTime" : 38.0,
    "pct2ResTime" : 41.0,
    "pct3ResTime" : 52.0,
    "throughput" : 4172.093799549361,
    "receivedKBytesPerSec" : 4281.918802287616,
    "sentKBytesPerSec" : 1751.9473714063674
  },
  "video_detail" : {
    "transaction" : "video_detail",
    "sampleCount" : 62506,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15.52961315713683,
    "medianResTime" : 14.0,
    "minResTime" : 0.0,
    "maxResTime" : 372.0,
    "pct1ResTime" : 18.0,
    "pct2ResTime" : 26.0,
    "pct3ResTime" : 30.0,
    "throughput" : 1043.9415448851773,
    "receivedKBytesPerSec" : 486.28917667014616,
    "sentKBytesPerSec" : 430.21809759916493
  },
  "feed_likes_count" : {
    "transaction" : "feed_likes_count",
    "sampleCount" : 62443,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.804333552199509,
    "medianResTime" : 9.0,
    "minResTime" : 1.0,
    "maxResTime" : 172.0,
    "pct1ResTime" : 15.0,
    "pct2ResTime" : 16.0,
    "pct3ResTime" : 19.0,
    "throughput" : 1043.150684931507,
    "receivedKBytesPerSec" : 1243.8349475599316,
    "sentKBytesPerSec" : 439.060493364726
  },
  "feed_latest" : {
    "transaction" : "feed_latest",
    "sampleCount" : 62534,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 24.444989925480645,
    "medianResTime" : 23.0,
    "minResTime" : 1.0,
    "maxResTime" : 342.0,
    "pct1ResTime" : 29.0,
    "pct2ResTime" : 31.0,
    "pct3ResTime" : 42.0,
    "throughput" : 1043.7467661442427,
    "receivedKBytesPerSec" : 1223.1407415752842,
    "sentKBytesPerSec" : 434.2149632592259
  }
}